// pages/history/notice/dateEnd/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    tagList: ["牛逼0", "牛逼1", "牛逼2", "牛逼3", "牛逼4", "牛逼5", "牛逼6", "牛逼7", "牛逼8", "牛逼9", "牛逼10", "牛逼11", "牛逼12", "牛逼13", "牛逼14", "牛逼15", "牛逼16", "牛逼17", "牛逼18", "牛逼19", "牛逼20", "牛逼21", "牛逼22", "牛逼23", "牛逼24", "牛逼25", "牛逼26", "牛逼27", "牛逼28", "牛逼29", "牛逼30", "牛逼31", "牛逼32", "牛逼33", "牛逼34", "牛逼35", "牛逼36", "牛逼37", "牛逼38", "牛逼39", "牛逼40", "牛逼41", "牛逼42", "牛逼43", "牛逼44", "牛逼45", "牛逼46", "牛逼47", "牛逼48", "牛逼49", "牛逼50", "牛逼51", "牛逼52", "牛逼53", "牛逼54", "牛逼55", "牛逼56", "牛逼57", "牛逼58", "牛逼59", "牛逼60", "牛逼61", "牛逼62", "牛逼63", "牛逼64", "牛逼65", "牛逼66", "牛逼67", "牛逼68", "牛逼69", "牛逼70", "牛逼71", "牛逼72", "牛逼73", "牛逼74", "牛逼75", "牛逼76", "牛逼77", "牛逼78", "牛逼79", "牛逼80", "牛逼81", "牛逼82", "牛逼83", "牛逼84", "牛逼85", "牛逼86", "牛逼87", "牛逼88", "牛逼89", "牛逼90", "牛逼91", "牛逼92", "牛逼93", "牛逼94", "牛逼95", "牛逼96", "牛逼97", "牛逼98", "牛逼99"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  },

  tapTag() {
    console.info(233);
  }
})