module.exports = [{
    "Q": "你倾向从何处得到力量：",
    "A": [{
      "result": "E",
      "text": "别人。"
    }, {
      "result": "I",
      "text": "自己的想法。"
    }]
  },

  {
    "Q": "当你参加一个社交聚会时，你会：",
    "A": [{
      "result": "E",
      "text": "在夜色很深时，一旦你开始投入，也许就是最晚离开的那一个。"
    }, {
      "result": "I",
      "text": "在夜晚刚开始的时候，我就疲倦了并且想回家。"
    }]
  },

  {
    "Q": "下列哪一件事听起来比较吸引你？",
    "A": [{
      "result": "E",
      "text": "与情人到有很多人且社交活动频繁的地方。"
    }, {
      "result": "I",
      "text": "待在家中与情人做一些特别的事情，例如说观赏一部有趣的录影带并享用你最喜欢的外卖食物。"
    }]
  },

  {
    "Q": "在约会中，你通常：",
    "A": [{
      "result": "E",
      "text": "整体来说很健谈。"
    }, {
      "result": "I",
      "text": "较安静并保留，直到你觉得舒服。"
    }]
  },

  {
    "Q": "过去，你遇见你大部分的情人是：",
    "A": [{
      "result": "E",
      "text": "在宴会中、夜总会、工作上、休闲活动中、会议上或当朋友介绍我给他们的朋友时。"
    }, {
      "result": "I",
      "text": "通过私人的方式，例如个人广告、录影约会，或是由亲密的朋友和家人介绍。"
    }]
  },

  {
    "Q": "你倾向拥有：",
    "A": [{
      "result": "E",
      "text": "很多认识的人和很亲密的朋友。"
    }, {
      "result": "I",
      "text": "一些很亲密的朋友和一些认识的人。"
    }]
  },

  {
    "Q": "过去，你的爱人和情人倾向对你说：",
    "A": [{
      "result": "E",
      "text": "你难道不可以安静一会儿吗？"
    }, {
      "result": "I",
      "text": "可以请你从你的世界中出来一下吗？"
    }]
  },

  {
    "Q": "你倾向通过以下哪种方式收集信息：",
    "A": [{
      "result": "N",
      "text": "你对有可能发生之事的想像和期望。"
    }, {
      "result": "S",
      "text": "你对目前状况的实际认知。"
    }]
  },

  {
    "Q": "你倾向相信：",
    "A": [{
      "result": "N",
      "text": "你的直觉。"
    }, {
      "result": "S",
      "text": "你直接的观察和现成的经验。"
    }]
  },

  {
    "Q": "当你置身于一段关系中时，你倾向相信：",
    "A": [{
      "result": "N",
      "text": "永远有进步的空间。"
    }, {
      "result": "S",
      "text": "若它没有被破坏，不予修补。"
    }]
  },

  {
    "Q": "当你对一个约会觉得放心时，你偏向谈论：",
    "A": [{
      "result": "N",
      "text": "未来，关于改进或发明事物和生活的种种可能性。例如，你也许会谈论一个新的科学发明，或一个更好的方法来表达你的感受。"
    }, {
      "result": "S",
      "text": "实际的、具体的、关于“此时此地”的事物。例如，你也许会谈论品酒的好方法，或你即将要参加的新奇旅程。"
    }]
  },

  {
    "Q": "你是这种人：",
    "A": [{
      "result": "N",
      "text": "喜欢先纵观全局。"
    }, {
      "result": "S",
      "text": "喜欢先掌握细节。"
    }]
  },

  {
    "Q": "你是这类型的人：",
    "A": [{
      "result": "N",
      "text": "与其活在现实中，不如活在想像里。"
    }, {
      "result": "S",
      "text": "与其活在想像里，不如活在现实中。"
    }]
  },

  {
    "Q": "你通常：",
    "A": [{
      "result": "N",
      "text": "偏向于去想像一大堆关于即将来临的约会的事情。"
    }, {
      "result": "S",
      "text": "偏向于拘谨地想像即将来临的约会，只期待让它自然地发生。"
    }]
  },

  {
    "Q": "你倾向如此做决定：",
    "A": [{
      "result": "F",
      "text": "首先依你的心意，然后依你的逻辑。"
    }, {
      "result": "T",
      "text": "首先依你的逻辑，然后依你的心意。"
    }]
  },

  {
    "Q": "你倾向比较能够察觉到：",
    "A": [{
      "result": "F",
      "text": "当人们需要情感上的支持时。"
    }, {
      "result": "T",
      "text": "当人们不合逻辑时。"
    }]
  },

  {
    "Q": "当和某人分手时：",
    "A": [{
      "result": "F",
      "text": "你通常让自己的情绪深陷其中，很难抽身出来。"
    }, {
      "result": "T",
      "text": "虽然你觉得受伤，但一旦下定决心，你会直截了当地将过去恋人的影子甩开。"
    }]
  },

  {
    "Q": "当与一个人交往时，你倾向于看重：",
    "A": [{
      "result": "F",
      "text": "情感上的相容性：表达爱意和对另一半的需求很敏感。"
    }, {
      "result": "T",
      "text": "智慧上的相容性：沟通重要的想法；客观地讨论和辩论事情。"
    }]
  },

  {
    "Q": "当你不同意情人的想法时：",
    "A": [{
      "result": "F",
      "text": "你尽可能地避免伤害对方的感情；若是会对对方造成伤害的话，你就不会说。"
    }, {
      "result": "T",
      "text": "你通常毫无保留地说话，并且对情人直言不讳，因为对的就是对的。"
    }]
  },

  {
    "Q": "认识你的人倾向形容你为：",
    "A": [{
      "result": "F",
      "text": "热情和敏感。"
    }, {
      "result": "T",
      "text": "逻辑和明确。"
    }]
  },

  {
    "Q": "你把大部分和别人的相遇视为：",
    "A": [{
      "result": "F",
      "text": "友善及重要的。"
    }, {
      "result": "T",
      "text": "另有目的。"
    }]
  },

  {
    "Q": "若你有时间和金钱，你的朋友邀请你到国外度假，并且在前一天才通知，你会：",
    "A": [{
      "result": "J",
      "text": "必须先检查你的时间表。"
    }, {
      "result": "P",
      "text": "立刻收拾行装。"
    }]
  },

  {
    "Q": "在第一次约会中：",
    "A": [{
      "result": "J",
      "text": "若你所约的人来迟了，你会很不高兴。"
    }, {
      "result": "P",
      "text": "一点儿都不在乎，因为你自己常常迟到。"
    }]
  },

  {
    "Q": "你偏好：",
    "A": [{
      "result": "J",
      "text": "事先知道约会的行程：要去哪里、有谁参加、你会在那里多久、该如何打扮。"
    }, {
      "result": "P",
      "text": "让约会自然地发生，不做太多事先的计划。"
    }]
  },

  {
    "Q": "你选择的生活充满着：",
    "A": [{
      "result": "J",
      "text": "日程表和组织。"
    }, {
      "result": "P",
      "text": "自然发生和弹性。"
    }]
  },

  {
    "Q": "哪一项较常见：",
    "A": [{
      "result": "J",
      "text": "你准时出席而其他人都迟到。"
    }, {
      "result": "P",
      "text": "其他人都准时出席而你迟到。"
    }]
  },

  {
    "Q": "你是这种喜欢……的人：",
    "A": [{
      "result": "J",
      "text": "下定决心并且做出最后肯定的结论。"
    }, {
      "result": "P",
      "text": "放宽你的选择面并且持续收集信息。"
    }]
  },

  {
    "Q": "你是此类型的人：",
    "A": [{
      "result": "J",
      "text": "喜欢在一段时间里专心于一件事情直到完成。"
    }, {
      "result": "P",
      "text": "享受同时进行好几件事情。"
    }]
  }
]